uhnp/src/Catalogs/ВидыОперацийУХ/ВидыОперацийУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОперацийУХ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БДДС_Приход</name>
      <description>БДДС, Приход</description>
    </items>
    <items>
      <name>БДДС_Расход</name>
      <description>БДДС, Расход</description>
    </items>
    <items>
      <name>БДР_Доход</name>
      <description>БДР, Доход</description>
    </items>
    <items>
      <name>БДР_Расход</name>
      <description>БДР, Расход</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперацииБюджетирование</name>
    <type>
      <types>EnumRef.ТипыОперацийБюджетирование</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимБезналичныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииДДСБезналичныйРасчет</name>
    <type>
      <types>DefinedType.ВидОперацииДДСБезналичные</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимНаличныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииДДСНаличныйРасчет</name>
    <type>
      <types>DefinedType.ВидОперацииДДСНаличные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПеремещениеСобственныхСредств</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВстречныйВидОперацииПереводСобственныхСредств</name>
    <comment>Встречный вид операции для ВГО</comment>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВстречныйВидОперацииВГО</name>
    <comment>Встречный вид операции для ВГО</comment>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВЗаявках</name>
    <comment>Операция может быть выбрана в документах &quot;Заявка на оплату&quot;, &quot;Планируемое поступление ДС&quot;, &quot;Заявка на расход&quot;, &quot;Ожидаемый доход&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРасчетыСКонтрагентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРасчетыСФизическимЛицом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСуммуСтавкуНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРасчетыПоЦеннымБумагам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКонвертацияВалюты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРасчетыПоНалогамИСборам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРасчетыБезДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаПлатежаВТабличнойЧасти</name>
    <comment>Расшифровка платежа выполняется в отдельной табличной части, иначе в полях формы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОсновнойВидОперацииДляХозяйственнойОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВДокументахФакта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПлатежныхПоручениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоРасчетыССамозанятыми</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляИндивидуальныхПредпринимателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоФакторинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРасчетыСНаемнымиРаботниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнкассация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКонтрагента</name>
    <type>
      <types>EnumRef.РолиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопустимыеВидыДоговоров</name>
    <attributes>
      <name>ВидДоговора</name>
      <type>
        <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыОперацийУХ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЭтоГруппа Тогда
		
		МассивНепроверяемыхРеквизитов = Новый Массив; 
		
		Если Не ДопустимБезналичныйРасчет Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВидОперацииДДСБезналичныйРасчет");	
		КонецЕсли;                                                                    
		
		Если Не ДопустимНаличныйРасчет Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВидОперацииДДСНаличныйРасчет");			
		КонецЕсли;
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		
		// проверка параметров пользовательских видов операций  
		Если ДопустимБезналичныйРасчет 
			И ДопустимНаличныйРасчет Тогда
			
			СтруктураПараметровБезналичныйРасчет = Справочники.ВидыОперацийУХ.ПолучитьСтруктуруПараметров();
			СтруктураПараметровНаличныйРасчет = Справочники.ВидыОперацийУХ.ПолучитьСтруктуруПараметров();
			
			ПараметрыВидыОпераций = ВидыОперацийУХВызовСервераПовтИсп.ПараметрыВидыОпераций();
			
			СтруктураПараметровЭталон = ПараметрыВидыОпераций[ВидОперацииДДСБезналичныйРасчет];
			Если ЗначениеЗаполнено(СтруктураПараметровЭталон) Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметровБезналичныйРасчет, СтруктураПараметровЭталон);	
			КонецЕсли;
			
			СтруктураПараметровЭталон = ПараметрыВидыОпераций[ВидОперацииДДСНаличныйРасчет];
			Если ЗначениеЗаполнено(СтруктураПараметровЭталон) Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметровНаличныйРасчет, СтруктураПараметровЭталон);	
			КонецЕсли;  
					
			Для каждого Элемент Из СтруктураПараметровБезналичныйРасчет Цикл
				Если Элемент.Значение <> СтруктураПараметровНаличныйРасчет[Элемент.Ключ] Тогда 
					ТекстСообщения = НСтр("ru = 'Выбраны противоречивые виды операции ДДС '");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);                                 
					Прервать;
            	КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
	
	
#КонецЕсли
